[Cues]
Act_E3_7A_CampusA_BeforeMeetingMark_Max_010="I do need a break from the Chloe Rollercoaster... And I just want to help her..."
Cue_E3_7A_CampusA_CHJefferson_JeffersonCrossMax01_Jefferson_001="Max, can I talk to you for a moment?"
Cue_E3_7A_CampusA_CHJefferson_JeffersonCrossMax01_Jefferson_004="I just wanted to see how you were doing."
Cue_E3_7A_CampusA_CHJefferson_JeffersonCrossMax01_Jefferson_007="I know. I'm truly sorry for Kate and that you all had to see that. If you want, there are counselors available."
Cue_E3_7A_CampusA_CHJefferson_JeffersonCrossMax01_Jefferson_008="I just wanted to remind you how proud we all are of you for helping Kate."
Cue_E3_7A_CampusA_CHJefferson_JeffersonCrossMax01_Jefferson_011="You are truly modest, Max. Aside from the selfies. But give yourself some credit. Hey, you alright?"
Cue_E3_7A_CampusA_CHJefferson_JeffersonCrossMax01_Jefferson_012="When you accused me of making Kate cry?"
Cue_E3_7A_CampusA_CHJefferson_JeffersonCrossMax01_Jefferson_014="You might be the nosiest student in the history of Blackwell."
Cue_E3_7A_CampusA_CHJefferson_JeffersonCrossMax01_Jefferson_015="Max, if I was as confused as you I might have done the same thing. But I honestly only tried to help Kate."
Cue_E3_7A_CampusA_CHJefferson_JeffersonCrossMax01_Jefferson_016="Honestly, Max? I was burned out on the contest. You think I'm a pretentious artist here, imagine me in San Francisco... I'm still rooting for you though."
Cue_E3_7A_CampusA_CHJefferson_JeffersonCrossMax01_Jefferson_020="Who needs a surveillance system when you have Max Caulfield and her camera eye? And, it's none of your business."
Cue_E3_7A_CampusA_CHJefferson_JeffersonCrossMax01_Jefferson_021="Max, I'm not an "Everyday Hero." I just tried to help Kate, but she didn't want my advice, okay?"
Cue_E3_7A_CampusA_CHJefferson_JeffersonCrossMax01_Jefferson_023="I hope that's not a fatal character flaw... Wouldn't want to deprive the art world of your vision."
Cue_E3_7A_CampusA_CHJefferson_JeffersonCrossMax01_Jefferson_024="Regret and nostalgia can be a dangerous combo. You can't change the past, Max. You just have to accept your choices and "walk on." Which is my clever exit cue."
Cue_E3_7A_CampusA_CHJefferson_JeffersonCrossMax01_Jefferson_025="You mean accusing Nathan Prescott of drugging Kate?"
Cue_E3_7A_CampusA_CHJefferson_JeffersonCrossMax01_Jefferson_026="You mean getting Nathan Prescott expelled?"
Cue_E3_7A_CampusA_CHJefferson_JeffersonCrossMax01_Jefferson_029="Since you reported him for having a gun as well, I want you to be careful around here. Not to scare you."
Cue_E3_7A_CampusA_CHJefferson_JeffersonCrossMax01_Jefferson_030="Well, I think Nathan is more bark than bite. Don't let him scare you."
Cue_E3_7A_CampusA_CHJefferson_JeffersonCrossMax01_Jefferson_032="When you accused David Madsen of bullying Kate?"
Cue_E3_7A_CampusA_CHJefferson_JeffersonCrossMax01_Jefferson_033="About David Madsen losing his Blackwell privileges?"
Cue_E3_7A_CampusA_CHJefferson_JeffersonCrossMax01_Jefferson_036="I absolutely believe you—as you can tell, I'm not a fan of his work. Don't let him scare you."
Cue_E3_7A_CampusA_CHJefferson_JeffersonCrossMax01_Jefferson_037="Because you have a good heart, Max. Nothing to feel guilty about. But don't waste that feeling on Madsen. Pardon my French, but he's fucking asshole. Don't let him scare you."
Cue_E3_7A_CampusA_CHJefferson_JeffersonCrossMax01_Jefferson_043="Once you get back from your suspension, we're going to talk about your future in photography, cool?"
Cue_E3_7A_CampusA_CHJefferson_JeffersonCrossMax01_Jefferson_044="We need to sit down soon and talk about your future in photography, cool?"
Cue_E3_7A_CampusA_CHJefferson_JeffersonCrossMax01_Max_003="Uh, sure, Mr. Jefferson."
Cue_E3_7A_CampusA_CHJefferson_JeffersonCrossMax01_Max_005="Thanks, but I didn't do much. She just needed somebody with her..."
Cue_E3_7A_CampusA_CHJefferson_JeffersonCrossMax01_Max_006="I'm okay. It's hard to focus on much after what happened..."
Cue_E3_7A_CampusA_CHJefferson_JeffersonCrossMax01_Max_009="No... but I don't know why I did that..."
Cue_E3_7A_CampusA_CHJefferson_JeffersonCrossMax01_Max_010="I just feel weird about what happened in the Principal's office yesterday..."
Cue_E3_7A_CampusA_CHJefferson_JeffersonCrossMax01_Max_013="Yeah... I feel shitty about you not getting to do the "Everyday Hero" contest... Do you hate me now?"
Cue_E3_7A_CampusA_CHJefferson_JeffersonCrossMax01_Max_017="Thanks, Mr. Jefferson. But a career in photography seems as far away now as San Francisco... I'm just not confident."
Cue_E3_7A_CampusA_CHJefferson_JeffersonCrossMax01_Max_018="I also saw you and Victoria talking last night..."
Cue_E3_7A_CampusA_CHJefferson_JeffersonCrossMax01_Max_019="How did you try to help Kate? She ran away crying..."
Cue_E3_7A_CampusA_CHJefferson_JeffersonCrossMax01_Max_022="I know, I know, it's a bad habit."
Cue_E3_7A_CampusA_CHJefferson_JeffersonCrossMax01_Max_031="Too late. I'm not always that brave."
Cue_E3_7A_CampusA_CHJefferson_JeffersonCrossMax01_Max_034="Yes. Even though he absolutely did."
Cue_E3_7A_CampusA_CHJefferson_JeffersonCrossMax01_Max_035="He deserved it. So why do I feel guilty?"
Cue_E3_7A_CampusA_CHJefferson_JeffersonCrossMax01_Max_038="Oh, you mean my silly retro selfies? The art world would only laugh."
Cue_E3_7A_CampusA_CHJefferson_JeffersonCrossMax01_Max_039="What "vision"?"
Cue_E3_7A_CampusA_CHJefferson_JeffersonCrossMax01_Max_040="Me neither. It just seems like another world."
Cue_E3_7A_CampusA_CHJefferson_JeffersonCrossMax01_Max_042="It's so hard for me to see the future when I'm always looking backwards..."
Cue_E3_7A_CampusA_CHJefferson_JeffersonCrossMax01_Max_045="Yes. And now, I expect him to come after me..."
Cue_E3_7A_CampusA_CHJefferson_JeffersonCrossMax01_Max_046="He drugged Kate. I know it."
Cue_E3_7A_CampusA_SmallTalk_Chloe_010="Never mind, Max. My life isn't worth your precious time anyway..."
Cue_E3_7A_CampusA_SmallTalk_Chloe_020="You can't help this time, Max. Not unless you can rewind back five years to save my dad... Have a nice day."
Cue_E3_7A_CampusA_SmallTalk_Chloe_030="You can't help this time, Max. Not unless you can rewind five years to save my dad... Have a nice day at school."
